tap "clojure/tools"
tap "filippo.io/age", "https://filippo.io/age"
tap "superfly/tap"

brew "age"
brew "arduino-cli"
brew "asdf"
brew "black"
brew "glib"
brew "clang-format"
brew "cmake"
brew "cobalt"
brew "deno"
brew "erlang"
brew "elixir"
brew "fd"
brew "figlet"
brew "fish"
brew "fnlfmt"
brew "fossil"
brew "fzf"
brew "git"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "delve"
brew "harfbuzz"
brew "graphviz"
brew "hugo"
brew "irssi"
brew "jq"
brew "ninja"
brew "meson"
brew "minicom"
brew "nats-server"
brew "neovim"
brew "nmap"
brew "openssh"
brew "pass"
brew "pass-otp"
brew "pinentry-mac"
brew "platformio"
brew "pwgen"
brew "rebar3"
brew "ripgrep"
brew "rsync"
brew "rust-analyzer"
brew "sqlc"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "universal-ctags"
brew "ykman"
brew "zig"
brew "zola"
brew "zsh-syntax-highlighting"
brew "clojure/tools/clojure"

# Skip, because it doesn't work with CLT 14.0. After official release of CLT 14.1,
# it will be possible to install this.
# brew "superfly/tap/flyctl"

cask "gcc-arm-embedded"
cask "alacritty"
cask "anki"
cask "eloston-chromium"
cask "kitty"
cask "nheko"
cask "signal"
cask "utm"
cask "visual-studio-code"
cask "yubico-yubikey-manager"
cask "syncthing"
cask "db-browser-for-sqlite"
cask "basictex"
